/* ----------------------------------------------------------------
 *  Copyright(C)2006 - 2013 联迪商用设备有限公司
 *  主要内容：ansix98
 *  创 建 人：
 *  创建日期：
 * ----------------------------------------------------------------
 * $Revision: 1.1 $
 * $Log: Lrc.c,v $
 * Revision 1.1  2012/11/20 03:27:37  chenjr
 * init
 *
 * ----------------------------------------------------------------
 */



/* ----------------------------------------------------------------
 * 功    能：纵向冗余校验
 * 输入参数：uszStr  生成标校验值的信息体
 *           iLen    信息体长度
 * 输出参数：
 * 返 回 值：纵向冗余校验值
 * 作    者：
 * 日    期：
 * 调用说明：
 * 修改日志：修改日期    修改者      修改内容简述
 * ----------------------------------------------------------------
 */
unsigned char Lrc(unsigned char *uszStr, int iLen)
{
    unsigned char ucLrc = 0;
    int i = 0;

    while (i<iLen)
    {
        ucLrc ^= uszStr[i];
        i++;
    }

    return ucLrc;
}



