/******************************************************************
 *** Copyright(C)2009－2012 福建联迪商用设备有限公司
 *** 主要内容：日志打印头文件，包含文件句柄，一些宏变量等内容
 *** 创 建 人：zhangwm
 *** 创建日期：2012/12/03
 ***
 *** ---------------------------------------------------------------
 ***   $Revision: 1.1 $
 ***   $Log: EpayLog.h,v $
 ***   Revision 1.1  2012/12/07 05:47:02  fengw
 ***
 ***   1、添加libepay库下头文件。
 ***
 ***   Revision 1.5  2012/11/29 07:09:22  zhangwm
 ***
 ***   增加判断是否打印日志
 ***
 ***   Revision 1.4  2012/11/28 07:23:01  zhangwm
 ***
 ***   修改弘定义值
 ***
 ***   Revision 1.3  2012/11/27 06:16:05  zhangwm
 ***
 ***   增加版本号和修改日志显示
 ***
 *** ---------------------------------------------------------------
 ***
 ********************************************************************/
#ifndef __EPAYLOG_H_
#define __EPAYLOG_H_


/* 日志文件名定义 */
#define H_LOG "/log/H_LOG"
#define M_LOG "/log/M_LOG"

#define H_TYPE 2
#define M_TYPE 3

/* 全局文件句柄 */
FILE* fpHLog;
FILE* fpMLog;

/* 日志打印相关数据变量长度定义 */
#define PATH_LEN 80
#define DATA_LEN 5120

#endif /* end __EPAYLOG_H */
